---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.LegendFailures
source: html/feaa00f9-bef4-c7d0-7529-eb71452554c7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LegendFailures

Failures about Legend.

## Syntax (C#)
```csharp
public static class LegendFailures
```